app/views/orders/index.html.erb

  <script type="text/javascript" charset="utf-8">
  $(function () {
  new Highcharts.Chart({
    chart: { renderTo: 'orders_chart' },
    title: { text: 'Ordenes por Día' },
    xAxis: { type: 'datetime' },
    yAxis: {
      title: { text: 'Pesos' }
    },
    tooltip: {
      formatter: function () {
        return Highcharts.dateFormat("%B %e %Y", this.x) + ': ' +
          '$' + Highcharts.numberFormat(this.y, 2);
      }
    },

    series: [{
      name: "Gastos",
      pointInterval: <%= 1.day * 1000 %>,
      pointStart: <%= 3.weeks.ago.at_midnight.to_i * 1000 %>,
      data: <%= (3.weeks.ago.to_date..Date.today).map { |date| Order.price_on(date).to_f}.inspect %>
    },
---
SELECT "orders".* FROM "orders"