app/controllers/dispatches_controller.rb

  def index
    @dispatches = Dispatch.order('created_at DESC').paginate(:page => params[:page], :per_page => 10)

    #@json = Dispatch.date_ok.to_gmaps4rails do |dispatch, marker|
    @json = Dispatch.all.to_gmaps4rails do |dispatch, marker|
---
SELECT "dispatches".* FROM "dispatches" WHERE (final >= '2013-05-16')

  def show
    @dispatch = Dispatch.find(params[:id])
---
SELECT "dispatches".* FROM "dispatches" WHERE "dispatches"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @dispatch = Dispatch.new(params[:dispatch])

    respond_to do |format|
      if @dispatch.save
---
INSERT INTO "dispatches" ("created_at", "description", "direction", "final", "gmaps", "latitude", "longitude", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @dispatch = Dispatch.find(params[:id])
    @dispatch.destroy
---
SELECT "dispatches".* FROM "dispatches" WHERE "dispatches"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "dispatches" WHERE "dispatches"."id" = ?  [["id", 1]]