app/controllers/orders_controller.rb

  def index
    @orders = Order.paginate(:page => params[:page], :per_page => 10)
---
SELECT "orders".* FROM "orders"

  def update
    @order = Order.find(params[:id])

    respond_to do |format|
      if @order.update_attributes(params[:order])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", "12"]]
UPDATE "orders" SET "state" = 'quebrado', "updated_at" = '2013-05-17 14:19:14.969837' WHERE "orders"."id" = 12