app/controllers/receive_controller.rb

  def update

    require 'twitter'

    #@quebrado = 0
    @quebrado = 1

    Order.quebrado.each do |quiebre|
---
SELECT "orders".* FROM "orders" WHERE (state = 'quebrado')